app/views/pages/_review.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<p>
  <%= link_to review.title, review_path(review) %> (<%= review.score %>/10, rated by
  <% if review.user.present? %>
    <%= review.user.username %>
  <% else %>
    Anonymous
  <% end %>)