app/controllers/bookmarks_controller.rb

  def create
    #find the review we're bookmarking
    @review = Review.find(params[:review_id])
    #create bookmark based on the id review
    @bookmark = @review.bookmarks.new
    #attach user to the bookmark
    @bookmark.user = @current_user
    #save it
    @bookmark.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("review_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["review_id", 6], ["user_id", 1], ["created_at", "2018-12-31 06:31:26.919891"], ["updated_at", "2018-12-31 06:31:26.919891"]]

  def destroy
    # find the bookmark from user
    @review = Review.find(params[:review_id])
    #unbookmark the item from particular user - see show.html.erb
    @review.bookmarks.where(user: @current_user).delete_all
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."review_id" = ? AND "bookmarks"."user_id" = 1  [["review_id", 7]]