app/controllers/comments_controller.rb

  def create
    # find the review based on resources set in config/routes.rb
    @review = Review.find(params[:review_id])
    #make a brand new comments using form params and only take the body based on @review
    @comment = @review.comments.new(params.require(:comment).permit(:body))
    #save the new comment
    @comment.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "review_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Hi"], ["review_id", 9], ["created_at", "2018-12-30 09:38:25.938683"], ["updated_at", "2018-12-30 09:38:25.938683"], ["user_id", 1]]