app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."url" = ? LIMIT ?  [["url", "home"], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE (score >= 8)
SELECT "reviews".* FROM "reviews" WHERE "reviews"."is_featured" = ?  [["is_featured", "t"]]
---
  def home
    #grabbing the page content via the url
    @content = Page.find_by(url: "home")

    #grabbing high 8 review - pulling from review model
    @highly_rated_reviews = Review.where("score >= 8")

    # grabbing the cureated review
    @featured_reviews = Review.where(is_featured: true)

SELECT  "pages".* FROM "pages" WHERE "pages"."url" = ? LIMIT ?  [["url", "about"], ["LIMIT", 1]]
---
  def about
    #grabbing the page content via the url
    @content = Page.find_by(url: "about")

SELECT  "pages".* FROM "pages" WHERE "pages"."url" = ? LIMIT ?  [["url", "terms"], ["LIMIT", 1]]
---
  def terms
    #grabbing the page content via the url
    @content = Page.find_by(url: "terms")