app/controllers/reviews_controller.rb

  def index
    # this is our list page for our review
    # variable is @.
    # creating a filter variable for price
    @price = params[:price]
    #creating a filter variable for cuisine
    @cuisine = params[:cuisine]
    # adding location filter using geocoder
    @location = params[:location]

    #filtering properly by get all the reviews "Review" model from the database
    #creating new review variable as ruby list[]
    #@reviews = ["The Smile", "Baby Bo's", "Chipotle", "nandos"]
    @reviews = Review.all

    # filtering by price. this will toggle on/off depend when it has filter
    if @price.present?
      #take all of the review we have and replace the original review with filtered ones
      # find the value of the price in db that matches the param above
      @reviews = @reviews.where(price: @price)
    end

    #filter by cuisine
    if @cuisine.present?
      @reviews = @reviews.where(cuisine: @cuisine)
---
SELECT reviews.*, (69.09332411348201 * ABS(reviews.latitude - -33.8548157) * 0.7071067811865475) + (59.836573914187355 * ABS(reviews.longitude - 151.2164539) * 0.7071067811865475) AS distance, CASE WHEN (reviews.latitude >= -33.8548157 AND reviews.longitude >= 151.2164539) THEN  45.0 WHEN (reviews.latitude <  -33.8548157 AND reviews.longitude >= 151.2164539) THEN 135.0 WHEN (reviews.latitude <  -33.8548157 AND reviews.longitude <  151.2164539) THEN 225.0 WHEN (reviews.latitude >= -33.8548157 AND reviews.longitude <  151.2164539) THEN 315.0 END AS bearing FROM "reviews" WHERE (reviews.latitude BETWEEN -34.1442792662217 AND -33.565352133778305 AND reviews.longitude BETWEEN 150.8678923811065 AND 151.56501541889352) ORDER BY distance ASC
SELECT reviews.*, (69.09332411348201 * ABS(reviews.latitude - -33.8548157) * 0.7071067811865475) + (59.836573914187355 * ABS(reviews.longitude - 151.2164539) * 0.7071067811865475) AS distance, CASE WHEN (reviews.latitude >= -33.8548157 AND reviews.longitude >= 151.2164539) THEN  45.0 WHEN (reviews.latitude <  -33.8548157 AND reviews.longitude >= 151.2164539) THEN 135.0 WHEN (reviews.latitude <  -33.8548157 AND reviews.longitude <  151.2164539) THEN 225.0 WHEN (reviews.latitude >= -33.8548157 AND reviews.longitude <  151.2164539) THEN 315.0 END AS bearing FROM "reviews" WHERE "reviews"."price" = ? AND (reviews.latitude BETWEEN -34.1442792662217 AND -33.565352133778305 AND reviews.longitude BETWEEN 150.8678923811065 AND 151.56501541889352) ORDER BY distance ASC  [["price", "Pricey"]]
SELECT reviews.*, (69.09332411348201 * ABS(reviews.latitude - -33.8548157) * 0.7071067811865475) + (59.836573914187355 * ABS(reviews.longitude - 151.2164539) * 0.7071067811865475) AS distance, CASE WHEN (reviews.latitude >= -33.8548157 AND reviews.longitude >= 151.2164539) THEN  45.0 WHEN (reviews.latitude <  -33.8548157 AND reviews.longitude >= 151.2164539) THEN 135.0 WHEN (reviews.latitude <  -33.8548157 AND reviews.longitude <  151.2164539) THEN 225.0 WHEN (reviews.latitude >= -33.8548157 AND reviews.longitude <  151.2164539) THEN 315.0 END AS bearing FROM "reviews" WHERE "reviews"."price" = ? AND "reviews"."cuisine" = ? AND (reviews.latitude BETWEEN -34.1442792662217 AND -33.565352133778305 AND reviews.longitude BETWEEN 150.8678923811065 AND 151.56501541889352) ORDER BY distance ASC  [["price", "Pricey"], ["cuisine", "Fusion"]]

  def create
  # this is a rails convention to compliment "new" function. This going to take info from the form and add it to the model
  #making sure that we add data only relating to "review" - something to do with hackers might able get access.
  # the ":[field]" denotes variable symbols that don't change
  @review = Review.new(form_params)

  # and then associate it with a user
  @review.user = @current_user

  # we can to check if the model can be saved, if it is, we're go to home page again, if it isn't show the form
  if @review.save
---
INSERT INTO "reviews" ("title", "body", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test review 1"], ["body", "This place was amazing"], ["score", 9], ["created_at", "2018-12-15 12:13:33.047466"], ["updated_at", "2018-12-15 12:13:33.047466"]]

  def show
    #this is going to be the individual review page using no. in db row using params array of :id. make sure we now create view page
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    #find the individual review
    @review = Review.find(params[:id])
    # check if user is current poster
    if @review.user == @current_user
      #destroy it
        @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]

  def edit
    #find the individual review to edit
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    #find the individual review
    @review = Review.find(params[:id])

    #check to see if you're the poster
    if @review.user != @current_user
      #take it back to homepage
      redirect_to root_path
    else
      #update the new info from the form - update with new info from the form
      if @review.update(form_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "restaurant" = ?, "ambiance" = ?, "cuisine" = ?, "price" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["restaurant", "Maccas"], ["ambiance", "Family"], ["cuisine", "fast-food"], ["price", 12], ["updated_at", "2018-12-21 11:11:59.800827"], ["id", 1]]