app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "fuzz"], ["LIMIT", 1]]
---
  def create

    #take the data entered and see if it matches with existing users
    @form_data = params.require(:session)
    #pull out the username and password form the form data (from object data)
    @username = @form_data[:username]
    @password = @form_data[:password]

    #lets check the user is who they say they are (checking username and match it with the password stored)
    @user = User.find_by(username: @username).try(:authenticate, @password)