app/controllers/users_controller.rb

  def index
    #notice its plural
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find_by(username: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "fuz"], ["LIMIT", 1]]

  def create
    #take the params from the form
    #create a new user,
    @user = User.new(form_params)
    #if valid saves, go to list users page
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)