app/views/reviews/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."review_id" = ?  [["review_id", 6]]
---
        <!-- ruby helper pluralize -->
        <%= review.cuisine %> - <%= pluralize review.comments.count, "comment" %>