app/views/reviews/show.html.erb

    <!-- This if statment will produce an array of all users that currently bookmarked  -->
    <% if @review.bookmarks.where(user: @current_user).any? %>
---
SELECT  1 AS one FROM "bookmarks" WHERE "bookmarks"."review_id" = ? AND "bookmarks"."user_id" = 1 LIMIT ?  [["review_id", 6], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."review_id" = ?  [["review_id", 7]]

  Posted by
    <% if @review.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

<!-- loop through each comments by descending order |[name of action]| -->
<% @review.comments.order("created_at desc").each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."review_id" = ? ORDER BY created_at desc  [["review_id", 6]]